backend: theano
class_name: Sequential
config:
  layers:
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.004999999888241291
      batch_input_shape: !!python/tuple
      - null
      - 14
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.009999999776482582
      name: dense_1
      trainable: true
      units: 10
      use_bias: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer:
        class_name: L1L2
        config:
          l1: 0.019999999552965164
          l2: 0.0
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0
          l2: 0.014999999664723873
      name: dense_2
      trainable: true
      units: 20
      use_bias: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 20
      use_bias: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 1
      use_bias: true
  name: sequential_1
keras_version: 2.3.1
